// for (let i = 1; i <= 10; i++) {
//     console.log(i);
// }

// ------------------------------------------------

// let i = 10
// while (i > 0) {
//     console.log(i)
//     i--
// }

// -------------------------------------------------

// const fruits = ['яблоко', 'банан', 'вишня'];
//
// for (let fruit of fruits) {
//     console.log(fruit);
// }

// ---------------------------------------------

// const car = {
//     brand: 'Toyota',
//     model: 'Corolla',
//     year: 2020
// };
//
// for (let carKey in car) {
//     console.log(car[carKey]);
// }

// ----------------------------------------------------------
// ----------------------------------------------------------

